PerformanceTest/pt02-login-average.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 1
      arrivalRate: 25
      name: "PT02 - Login - Average (25 concurrent)"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Login flow"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "lipa@bloodsync.site"
            password: "password123"
          expect:
            - statusCode: 200

# Run with server started as: DISABLE_RATE_LIMIT=true node server.js
# Then: artillery run pt02-login-average.yml -o pt02-results.json