PerformanceTest/pt03-login-peak.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 1
      arrivalRate: 50
      name: "PT03 - Login - Peak (50 concurrent)"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Login flow"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "lipa@bloodsync.site"
            password: "password123"
          expect:
            - statusCode: 200

# Run with server started as: DISABLE_RATE_LIMIT=true node server.js
# Then: artillery run pt03-login-peak.yml -o pt03-results.json