PerformanceTest/pt19-upload-low.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 1
      arrivalRate: 10
      name: "PT19 - File upload - Low (10 concurrent)"

scenarios:
  - name: "Requestor login + submit with large file"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "maria@email.com"
            password: "password123"
          expect:
            - statusCode: 200

      # sample-large.png (~4MB) — near the 5MB cap set by uploadMiddleware.js,
      # to specifically stress upload/Cloudinary time rather than just
      # request handling (PT07-09 already covers the small-file case).
      - post:
          url: "/api/blood-requests"
          formData:
            hospital_id: "5"
            branch_id: "1"
            patient_name: "Load Test Patient"
            patient_age: "30"
            diagnosis: "Performance test - large file upload (PT22-24)"
            urgency_level: "Routine"
            items: '[{"blood_type":"O+","component":"Whole Blood","units_requested":1}]'
            request_form:
              fromFile: "./sample.png"
          expect:
            - statusCode: 201

# Run with server started as: DISABLE_RATE_LIMIT=true node server.js
# File must be in the same folder as this yml: sample.png
# Then: artillery run pt22-upload-low.yml -o pt22-results.json